app/Http/Middleware/Language.php

select * from `admin_languages` where `is_active` = 1
---
    public function handle($request, Closure $next)
    {
        $adminLang = AdminLanguage::where("is_active", 1)->get()->pluck("label", "name")->toArray();
        if (Session::has('applocale') AND array_key_exists(Session::get('applocale'), $adminLang)) {