app/Http/Controllers/IndexController.php

select * from `pages` where `is_in_menu` = 1 and `is_active` = 1 and `parent_id` is null order by `lft` asc
select * from `pages` where `is_in_menu` = 1 and `parent_id` = 1 order by `lft` asc
---
    public function get_menu(){
        $menu = Page::where("is_in_menu", 1)->where("is_active", 1)->where("parent_id", null)->orderBy("lft", "asc")->get();
        if($menu){
            foreach ($menu as $item){
                $check = Page::where("is_in_menu", 1)->where("parent_id", $item->id)->orderBy("lft", "asc")->get();

select * from `admin_languages` where `is_active` = 1 and `is_frontend` = 1
select * from `pages` where slug LIKE '%"it":"prodotti"%' and `is_active` = 1 limit 1
---
    public function check_page($slug = null){
        $slug_excluded = [];
        $slug_excluded[] = env('SLUG_LOGIN');
        $slug_excluded[] = env('SLUG_REGISTER');
        $slug_excluded[] = env('SLUG_COMPARE');
        $slug_excluded[] = env('SLUG_RECOVERY');
        $slug_excluded[] = env('SLUG_CHANGE_PSW');
        $slug_excluded[] = env('SLUG_CART');
        $slug_excluded[] = "checkout";


        if($slug !== null) {
            $currenturl = url()->full();
            $currentSlug = basename($currenturl);
            $currentSlug = addslashes($currentSlug);
            $adminLangs = AdminLanguage::where("is_active", 1)->where("is_frontend", 1)->get();
            if ($adminLangs) {
                foreach ($adminLangs as $item_lang) {
                    $item = Page::whereRaw("slug LIKE '%\"{$item_lang->name}\":\"$currentSlug\"%'")->where("is_active", 1)->first();

select * from `pages` where `is_homepage` = 1 and `is_active` = 1 limit 1
select * from `pages` where slug LIKE '%:"prodotti"%' and `is_active` = 1 limit 1
---

        $lang = \App::getLocale();
        if($slug === null){
            $page = Page::where("is_homepage", 1)->where("is_active", 1)->first();
        }else{
            $slug = addslashes($slug);

            $page = Page::whereRaw("slug LIKE '%\"$lang\":\"$slug\"%'")->where("is_active", 1)->first();

select * from `website_settings` limit 1
---
    public function index($slug = null)
    {

        if(env('NASCONDI_FRONTEND') == 1){
            return redirect()->to("/admin");
        }

        $website = WebsiteSetting::first();