app/Http/Controllers/PluginProductsController.php

    public function pluginProducts(Request $request, $slug = null)
    {
        $adminPlugin = \App\Models\AdminPlugin::where("name", "pluginProducts")->first();

        $currenturl = url()->full();
        $currentSlug = basename($currenturl);
        $adminLangs = AdminLanguage::where("is_active", 1)->where("is_frontend", 1)->get();
        if($adminLangs){
            foreach ($adminLangs as $item_lang){
                $item = Page::whereRaw("slug LIKE '%\"{$item_lang->name}\":\"$currentSlug\"%'")->first();
---
select * from `admin_plugins` where `name` = 'pluginProducts' limit 1
select * from `admin_languages` where `is_active` = 1 and `is_frontend` = 1
select * from `pages` where slug LIKE '%"it":"shop"%' limit 1

           }
        }

        $page = Page::whereRaw("slug like '%$slug_prodotti%'")->where("is_active", 1)->first();
---
select * from `pages` where slug like '%shop%' and `is_active` = 1 limit 1




        $website = WebsiteSetting::first();

        $menu = Page::where("is_in_menu", 1)->where("is_active", 1)->where("parent_id", null)->orderBy("lft", "asc")->get();
        if($menu){
            foreach ($menu as $item){
                $check = Page::where("is_in_menu", 1)->where("parent_id", $item->id)->orderBy("lft", "asc")->get();
---
select * from `website_settings` limit 1
select * from `pages` where `is_in_menu` = 1 and `is_active` = 1 and `parent_id` is null order by `lft` asc
select * from `pages` where `is_in_menu` = 1 and `parent_id` = 1 order by `lft` asc

            }
        }

        $plugin = PluginProductsSettings::first();
---
select * from `plugins_products_settings` where `plugins_products_settings`.`deleted_at` is null limit 1

            }else{
                $products = PluginProducts::selectRaw("plugins_products.*")
                    //->join("plugins_products_langs", "plugins_products_langs.product_id", "=", "plugins_products.id")
                    //->whereRaw("lang = '$lang' AND plugins_products_langs.is_active = 1")
                    ->join("plugins_products_search", "plugins_products_search.plugin_product_id", "=", "plugins_products.id")
                    ->whereRaw("langs LIKE '%,$lang,%'")
                    ->where("plugins_products.is_active", 1)
                    ->where("plugins_products.is_variant", 0)
                    ->whereRaw("$sql_padri $sql_brands $sql_tags $sql_price_max $sql_search")
                    ->orderBy("is_evidenza", "DESC")
                    ->orderBy("lft", "asc")
                    ->orderBy("plugins_products.$field_order_by", $field_order_type)
                    ->groupBy("plugins_products.id")
                    ->paginate($select_show_number);
---
select count(*) as aggregate from (select plugins_products.* from `plugins_products` inner join `plugins_products_search` on `plugins_products_search`.`plugin_product_id` = `plugins_products`.`id` where langs LIKE '%,it,%' and `plugins_products`.`is_active` = 1 and `plugins_products`.`is_variant` = 0 and 1=1     and `plugins_products`.`deleted_at` is null group by `plugins_products`.`id`) as `aggregate_table`
select plugins_products.* from `plugins_products` inner join `plugins_products_search` on `plugins_products_search`.`plugin_product_id` = `plugins_products`.`id` where langs LIKE '%,it,%' and `plugins_products`.`is_active` = 1 and `plugins_products`.`is_variant` = 0 and 1=1     and `plugins_products`.`deleted_at` is null group by `plugins_products`.`id` order by `is_evidenza` desc, `lft` asc, `plugins_products`.`name` asc limit 24 offset 0

                    ->orderBy("lft", "asc")
                    ->get();
            }else{
                $categories = PluginProductsCategories::where("is_active", 1)
                    ->where("parent_id", null)
                    ->where("is_purchasable", 1)
                    ->orderBy("lft", "asc")
                    ->get();
---
select * from `plugins_products_categories` where `is_active` = 1 and `parent_id` is null and `is_purchasable` = 1 and `plugins_products_categories`.`deleted_at` is null order by `lft` asc

    public function get_categories_sidebar($categories, $productsAllVet_Temp = null){
        /*$sql_add = "plugins_products_categories.is_active = 1";
        if($productsAllVet_Temp){
            $ids_string = implode(",", $productsAllVet_Temp);
            $sql_add = "plugins_products_categories.is_active = 1 AND plugin_product_product_id IN ($ids_string)";
        }*/

        if($categories){

            foreach ($categories as $k=>$item){

                /*$item->count = PluginProductsCategoriesProducts::join("plugins_products_categories", "plugins_products_categories.id", "=", "plugins_products_categories_products.plugin_product_category_id")
                    ->join("plugins_products", "plugins_products.id", "=", "plugins_products_categories_products.plugin_product_product_id")
                    ->where("plugin_product_category_id", $item->id)
                    ->whereRaw($sql_add)
                    ->where("plugins_products.is_variant", 0)
                    ->where("plugins_products.is_active", 1)
                    ->whereNull("plugins_products.deleted_at")
                    ->count();*/

                $item->count = PluginProductsSearch::whereRaw("categories LIKE '%,$item->id,%'")->where("is_active", 1)->where("is_variant", 0)->count();


                $check = PluginProductsCategories::where("parent_id", $item->id)->where("is_active", 1)->orderBy("lft", "asc")->get();
---
select count(*) as aggregate from `plugins_products_search` where categories LIKE '%,138,%' and `is_active` = 1 and `is_variant` = 0
select * from `plugins_products_categories` where `parent_id` = 138 and `is_active` = 1 and `plugins_products_categories`.`deleted_at` is null order by `lft` asc

                                ->whereNull("plugins_products.deleted_at")
                                ->count();*/

                            $figlio->count = PluginProductsSearch::whereRaw("categories LIKE '%,$figlio->id,%'")->where("is_active", 1)->where("is_variant", 0)->count();

                            $tot_figli = $tot_figli + $figlio->count;

                            $check_2 = PluginProductsCategories::where("parent_id", $figlio->id)->where("is_active", 1)->orderBy("lft", "asc")->get();
---
select count(*) as aggregate from `plugins_products_search` where categories LIKE '%,125,%' and `is_active` = 1 and `is_variant` = 0
select * from `plugins_products_categories` where `parent_id` = 125 and `is_active` = 1 and `plugins_products_categories`.`deleted_at` is null order by `lft` asc

    public function get_all_products_sidebar($products_processed = null){
        $productsAll = $products_processed;
        $productsAllVet = $products_processed->pluck("id")->toArray();
        //$productsAllVetAttributes = $products_processed->whereNotNull("attributes")->pluck("attributes", "id")->toArray();

        $pluginSetting = PluginProductsSettings::first();
---
select * from `plugins_products_settings` where `plugins_products_settings`.`deleted_at` is null limit 1

        $vet_prices = [];
        $now = Carbon::now()->toDateTimeString();

        $promo_priority = Promotion::whereRaw("(start_date <= '$now' AND expiration_date >='$now') AND is_forced = 1")
            ->count();
---
select count(*) as aggregate from `shop_promotions` where (start_date <= '2025-02-25 16:06:21' AND expiration_date >='2025-02-25 16:06:21') AND is_forced = 1

        $brands_ids = [];
        if(count($brands_v)){
            foreach ($brands_v as $brand_id){
                $temp = PluginProductsBrands::find($brand_id);
---
select * from `plugins_products_brands` where `plugins_products_brands`.`id` = '1' and `plugins_products_brands`.`deleted_at` is null limit 1