app/Models/Order.php

    public function get_total(){
        $sum = OrderProduct::selectRaw("SUM(price_with_tax * quantity) as tot")->where("order_id", $this->id)->first();
---
select SUM(price_with_tax * quantity) as tot from `shop_order_product` where `order_id` = 17 limit 1