app/Models/Page.php

    public function getMenu(){
        if($this->slug == "/"){
            $linkAnteprima = "/";
        }else{
            $linkAnteprima = "/$this->slug";
        }

        $url_edit = "/admin/page/$this->id/edit";

        $pages_count = Page::count();
        $website = WebsiteSetting::first();
---
select count(*) as aggregate from `pages`
select * from `website_settings` limit 1