app/Models/PluginProducts.php

select plugins_products_categories.* from `plugins_products_categories_products` inner join `plugins_products_categories` on `plugins_products_categories`.`id` = `plugins_products_categories_products`.`plugin_product_category_id` where `plugin_product_product_id` = 955 limit 1
select * from `plugins_products_categories` where `plugins_products_categories`.`id` = 16 and `plugins_products_categories`.`deleted_at` is null limit 1
---
    public function category(){
        $item = PluginProductsCategoriesProducts::selectRaw("plugins_products_categories.*")
            ->join("plugins_products_categories", "plugins_products_categories.id", "=", "plugins_products_categories_products.plugin_product_category_id")
            ->where("plugin_product_product_id", $this->id)
            ->first();

        if($item){
            return PluginProductsCategories::find($item->id);

select * from `plugins_products_langs` where `product_id` = 955 and `lang` = 'it' and `image` is not null limit 1
select * from `plugins_products_images` where `product_id` = 955 order by `order` asc limit 1
---
    public function getCover(){
        $check = PluginProductsLangs::where("product_id", $this->id)->where("lang", \App::getLocale())->whereNotNull("image")->first();
        if(!$check){
            $check = PluginProductsImages::where("product_id", $this->id)->orderBy("order", "asc")->first();

select * from `plugins_products_settings` where `plugins_products_settings`.`deleted_at` is null limit 1
select * from `admin_plugins` where `name` = 'pluginProducts' limit 1
select count(*) as aggregate from `shop_promotions` where (start_date <= '2025-02-25 16:06:14' AND expiration_date >='2025-02-25 16:06:14') AND is_forced = 1
---
    public function get_promo_price($piuiva = null){
        $now = Carbon::now()->toDateTimeString();
        $now_base = Carbon::now();

        $plugin = PluginProductsSettings::first();
        $adminPlugin = AdminPlugin::where("name", "pluginProducts")->first();

        $priceStart = $this->price;

        if(\Auth::user() && in_array(\Auth::user()->country_id, config('config.default_country_user_dollar'))){
            if($this->price_dollar){
                $priceStart = $this->price_dollar;
            }
        }

        if(\Auth::user() && in_array(\Auth::user()->country_id, config('config.default_country_user_listino_2'))){
            if($this->price_2){
                $priceStart = $this->price_2;
            }
        }

        $promo_priority = Promotion::whereRaw("(start_date <= '$now' AND expiration_date >='$now') AND is_forced = 1")
            ->count();

select * from `shop_promotions` where `category_id` in (16, 125) and (start_date <= '2025-02-25 16:06:14' AND expiration_date >='2025-02-25 16:06:14')
---

            //controllo se esistono promozioni per categoria
            if(count($categories_ids)){
                $promotions = Promotion::whereIn("category_id", $categories_ids)
                    ->whereRaw("(start_date <= '$now' AND expiration_date >='$now')")
                    ->get();

select * from `shop_promotions` where `brand_id` = 21 and `category_id` is null and (start_date <= '2025-02-25 16:06:14' AND expiration_date >='2025-02-25 16:06:14')
---
            }

            if($this->brand_id !== null) {
                $promotions = Promotion::where("brand_id", $this->brand_id)
                    ->whereNull("category_id")
                    ->whereRaw("(start_date <= '$now' AND expiration_date >='$now')")
                    ->get();