app/Http/Controllers/Admin/AdminLanguageController.php

select * from `admin_blocks` where `name` = 'website' and `admin_blocks`.`deleted_at` is null limit 1
---
            $item_id = $parameters['id'];
        }
        $item = null;
        $adminBlock = AdminBlock::where("name", $chiave)->first();

select * from `website_settings` where `website_settings`.`id` = '1' limit 1
---
                        "Testo quando sito è offline", "Titolo Popup", "Testo Popup", "Iubenda Privacy (Footer)", "Iubenda Cookie (Footer)",
                        "Iubenda Banner (Footer)", "Iubenda Termini (footer)"];
                    if(count($parameters)) {
                        $item = WebsiteSetting::find($item_id);