app/Http/Controllers/Admin/DashboardController.php

    public function index(Request $request){
        if(backpack_user()->roles[0]->id < 5) {
            $website_setting = WebsiteSetting::first();
---
select * from `website_settings` limit 1