app/Http/Controllers/Admin/PageCrudController.php

    public function clone($id)
    {
        $this->crud->hasAccessOrFail('clone');
        $this->crud->setOperation('clone');

        // whatever you want

        $old = Page::find($id);
        // if you still want to call the old clone method
        $this->traitClone($id);
        $new = Page::orderBy("id", "desc")->first();
        $new->is_active = 0;
        $new->save();

        //blocks
        $list = \DB::table("blocks_pages")->where("page_id", $id)->whereNull("deleted_at")->get();
        if($list){
            foreach ($list as $block){
                $adminBlock = \App\Models\AdminBlock::where("name", $block->type)->first();
---
select * from `pages` where `pages`.`id` = '1' limit 1
select * from `pages` order by `id` desc limit 1
update `pages` set `is_active` = 0, `pages`.`updated_at` = '2025-02-25 17:10:29' where `id` = 43
select * from `blocks_pages` where `page_id` = '1' and `deleted_at` is null
select * from `admin_blocks` where `name` = 'blockSlideshow' and `admin_blocks`.`deleted_at` is null limit 1

    protected function setupListOperation()
    {
        //CRUD::setFromDb(); // columns

        /**
         * Columns can be defined using the fluent syntax or array syntax:
         * - CRUD::column('price')->type('number');
         * - CRUD::addColumn(['name' => 'price', 'type' => 'number']);
         */
        $this->crud->addButtonFromModelFunction('line', 'getMenu', 'getMenu', 'beginning'); // add a button whose HTML is returned by a method in the CRUD model

        $pages_count = Page::count();
        $website = WebsiteSetting::first();
---
select count(*) as aggregate from `pages`
select * from `website_settings` limit 1

        ]);


        $adminPlugin = \App\Models\AdminPlugin::where("name", "pluginProducts")->where("is_active", 1)->first();
---
select * from `admin_plugins` where `name` = 'pluginProducts' and `is_active` = 1 limit 1

                    function() { // if the filter is active
                        // $this->crud->addClause('active'); // apply the "active" eloquent scope
                    } );
            }
        }



        $adminPluginBooking = \App\Models\AdminPlugin::where("name", "pluginBookings")->where("is_active", 1)->first();
---
select * from `admin_plugins` where `name` = 'pluginBookings' and `is_active` = 1 limit 1