app/Http/Controllers/Admin/WebsiteSettingCrudController.php


                // CAMPI VISUALIZZATI SOLO CON IL TEMA WEBSHOP//////////////////
                if(env('TEMA') == 'Webshop' ){
                    $adminPluginProduct = \App\Models\AdminPlugin::where("name", "pluginProducts")->first();
---
select * from `admin_plugins` where `name` = 'pluginProducts' limit 1